## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 13 to change, 5 to destroy.</code></pre>

* Create
  * module.vm-bootstrap[&#34;atlassian-nonprod-confluence-02&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-confluence-04&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-crowd-01&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-01&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-02&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-gluster-03&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-01&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-02&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap[&#34;atlassian-nonprod-jira-03&#34;].azurerm_virtual_machine_extension.custom_script[0]
* Update
  * azurerm_application_gateway.ag
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-04&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-crowd-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-03&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-03&#34;]
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0]
* Delete
  * azurerm_postgresql_server.atlassian-server[0]
  * azurerm_private_endpoint.postgres_private_endpoint[0]
  * terraform_data.postgres[&#34;confluence&#34;]
  * terraform_data.postgres[&#34;crowd&#34;]
  * terraform_data.postgres[&#34;jira&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-04"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-04/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-04"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-crowd-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-crowd-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-crowd-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-03"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-03/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-03"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-03"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-03/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-03"
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                              = "atlassian-nonprod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server-v15" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server-v15"
        name                              = "atlassian-nonprod-flex-server-v15"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server[0] will be destroyed
  # (because azurerm_postgresql_server.atlassian-server is not in configuration)
  - resource "azurerm_postgresql_server" "atlassian-server" {
      - administrator_login                     = (sensitive value) -> null
      - administrator_login_password            = (sensitive value) -> null
      - administrator_login_password_wo         = (write-only attribute) -> null
      - administrator_login_password_wo_version = 0 -> null
      - auto_grow_enabled                       = true -> null
      - backup_retention_days                   = 7 -> null
      - create_mode                             = "Default" -> null
      - fqdn                                    = "atlassian-nonprod-server.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled            = false -> null
      - id                                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server" -> null
      - infrastructure_encryption_enabled       = false -> null
      - location                                = "uksouth" -> null
      - name                                    = "atlassian-nonprod-server" -> null
      - public_network_access_enabled           = false -> null
      - resource_group_name                     = "atlassian-nonprod-rg" -> null
      - sku_name                                = "MO_Gen5_8" -> null
      - ssl_enforcement_enabled                 = true -> null
      - ssl_minimal_tls_version_enforced        = "TLS1_2" -> null
      - storage_mb                              = 204800 -> null
      - tags                                    = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "startupMode"  = "always"
        } -> null
      - version                                 = "11" -> null
    }

  # azurerm_private_endpoint.postgres_private_endpoint[0] will be destroyed
  # (because azurerm_private_endpoint.postgres_private_endpoint is not in configuration)
  - resource "azurerm_private_endpoint" "postgres_private_endpoint" {
      - custom_dns_configs            = [] -> null
      - id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe" -> null
      - location                      = "uksouth" -> null
      - name                          = "atlassian-nonprod-postgres-pe" -> null
      - network_interface             = [
          - {
              - id   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-nonprod-postgres-pe.nic.831cde3a-c6ce-4027-b2f3-5a4d93754717"
              - name = "atlassian-nonprod-postgres-pe.nic.831cde3a-c6ce-4027-b2f3-5a4d93754717"
            },
        ] -> null
      - private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe/privateDnsZoneGroups/privatelink.postgres.database.azure.com/privateDnsZoneConfigs/privatelink.postgres.database.azure.com"
              - name                = "privatelink.postgres.database.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "atlassian-nonprod-server.privatelink.postgres.database.azure.com"
                      - ip_addresses = [
                          - "10.0.4.4",
                        ]
                      - name         = "atlassian-nonprod-server"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name           = "atlassian-nonprod-rg" -> null
      - subnet_id                     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet/subnets/atlassian-int-subnet-postgres" -> null
      - tags                          = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "startupMode"  = "always"
        } -> null
        # (1 unchanged attribute hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe/privateDnsZoneGroups/privatelink.postgres.database.azure.com" -> null
          - name                 = "privatelink.postgres.database.azure.com" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection              = false -> null
          - name                              = "postgres-psc" -> null
          - private_connection_resource_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server" -> null
          - private_ip_address                = "10.0.4.4" -> null
          - subresource_names                 = [
              - "postgresqlServer",
            ] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # terraform_data.postgres["confluence"] will be destroyed
  # (because terraform_data.postgres is not in configuration)
  - resource "terraform_data" "postgres" {
      - id               = "8df6909e-1027-9ee3-f766-e9ef9941c166" -> null
      - triggers_replace = [
          - "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-password/27dbe290bd5a4b629f8a5cc4096b33d9",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-username/6c585d3ebb284b52822375f326a01ed1",
        ] -> null
    }

  # terraform_data.postgres["crowd"] will be destroyed
  # (because terraform_data.postgres is not in configuration)
  - resource "terraform_data" "postgres" {
      - id               = "543fa44e-d604-72f1-d5f1-c1ed62483df9" -> null
      - triggers_replace = [
          - "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/crowd-db-nonprod-postgres-password/e36bd17fc9a64b13b6bc74f235f3f37a",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/crowd-db-nonprod-postgres-username/2a6d0e45588c4fbeabcb9a14819fdde9",
        ] -> null
    }

  # terraform_data.postgres["jira"] will be destroyed
  # (because terraform_data.postgres is not in configuration)
  - resource "terraform_data" "postgres" {
      - id               = "e02bb0f1-40e6-0f8e-fcfb-bd5c7d3d2268" -> null
      - triggers_replace = [
          - "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-password/d43e7690b13a491c83359558c1b7f614",
          - "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-username/82c4e4a604864795979c11cde79787cf",
        ] -> null
    }

  # module.vm-bootstrap["atlassian-nonprod-confluence-02"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-02"
    }

  # module.vm-bootstrap["atlassian-nonprod-confluence-04"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-04"
    }

  # module.vm-bootstrap["atlassian-nonprod-crowd-01"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-crowd-01"
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-01"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01"
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-02"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-02"
    }

  # module.vm-bootstrap["atlassian-nonprod-gluster-03"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03"
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-01"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01"
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-02"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-02"
    }

  # module.vm-bootstrap["atlassian-nonprod-jira-03"].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-03"
    }

Plan: 9 to add, 13 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":106,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->